package m45_sql_dml.practice;

/**
 * Задача 02 — Модуль 45: SELECT с условиями
 *
 * ЗАДАНИЕ (SQL) для таблицы employees (см. Task01):
 *   1) сотрудники с зарплатой больше 70000;
 *   2) сотрудники отдела 'IT' с зарплатой >= 60000 (AND);
 *   3) сотрудники отделов 'IT' или 'HR' (OR);
 *   4) все сотрудники, отсортированные по зарплате по убыванию;
 *   5) только имена и зарплаты, с псевдонимами (AS).
 *
 * ПОДСКАЗКА:
 *   SELECT * FROM employees WHERE salary > 70000;
 *   SELECT name AS Сотрудник, salary AS Оклад FROM employees;
 */
public class Task02 {
    public static void main(String[] args) {
        String sql = """
            -- ============================================
            -- ПОДГОТОВКА ТАБЛИЦЫ И ДАННЫХ (для тестирования)
            -- ============================================
            CREATE TABLE IF NOT EXISTS employees (
                id         INT PRIMARY KEY AUTO_INCREMENT,
                name       VARCHAR(100) NOT NULL,
                department VARCHAR(50),
                salary     DECIMAL(10,2),
                hired      DATE
            );
            
            -- Добавляем тестовые данные
            INSERT INTO employees (name, department, salary, hired) VALUES
                ('Иван Петров', 'IT', 80000.00, '2020-03-15'),
                ('Мария Смирнова', 'HR', 65000.00, '2019-07-22'),
                ('Петр Сидоров', 'IT', 95000.00, '2018-11-01'),
                ('Анна Кузнецова', 'Finance', 72000.00, '2021-02-10'),
                ('Сергей Иванов', 'Marketing', 68000.00, '2020-09-14'),
                ('Елена Петрова', 'IT', 55000.00, '2019-05-30'),
                ('Алексей Васильев', 'Sales', 70000.00, '2021-06-01'),
                ('Ольга Павлова', 'IT', 90000.00, '2018-03-20'),
                ('Дмитрий Новиков', 'HR', 58000.00, '2022-01-15'),
                ('Наталья Соколова', 'Finance', 82000.00, '2019-11-10');
            
            -- ============================================
            -- 1) СОТРУДНИКИ С ЗАРПЛАТОЙ БОЛЬШЕ 70000
            -- ============================================
            SELECT * 
            FROM employees 
            WHERE salary > 70000;
            
            -- ============================================
            -- 2) СОТРУДНИКИ IT С ЗАРПЛАТОЙ >= 60000 (AND)
            -- ============================================
            SELECT * 
            FROM employees 
            WHERE department = 'IT' AND salary >= 60000;
            
            -- ============================================
            -- 3) СОТРУДНИКИ IT ИЛИ HR (OR)
            -- ============================================
            SELECT * 
            FROM employees 
            WHERE department = 'IT' OR department = 'HR';
            
            -- Альтернатива с IN
            -- SELECT * FROM employees WHERE department IN ('IT', 'HR');
            
            -- ============================================
            -- 4) СОТРУДНИКИ, ОТСОРТИРОВАННЫЕ ПО ЗАРПЛАТЕ ПО УБЫВАНИЮ
            -- ============================================
            SELECT * 
            FROM employees 
            ORDER BY salary DESC;
            
            -- ============================================
            -- 5) ТОЛЬКО ИМЕНА И ЗАРПЛАТЫ С ПСЕВДОНИМАМИ (AS)
            -- ============================================
            SELECT 
                name AS Сотрудник, 
                salary AS Оклад
            FROM employees;
            """;
        System.out.println(sql);
    }
}
