package m45_sql_dml.practice;

/**
 * Задача 03 — Модуль 45: Поиск по шаблону (LIKE)
 *
 * ЗАДАНИЕ (SQL) для таблицы employees:
 *   1) сотрудники, чьё имя начинается на 'А';
 *   2) сотрудники, чьё имя заканчивается на 'ов';
 *   3) сотрудники, в имени которых есть 'ан' (в любом месте);
 *   4) сотрудники, имя которых состоит ровно из 4 символов
 *      (подсказка: '____' — четыре подчёркивания).
 *
 * ПОДСКАЗКА:
 *   % — любое количество символов, _ — ровно один символ.
 *   WHERE name LIKE 'А%'   WHERE name LIKE '%ов'   WHERE name LIKE '%ан%'
 */
public class Task03 {
    public static void main(String[] args) {
        String sql = """
            -- ============================================
            -- ПОДГОТОВКА ТАБЛИЦЫ И ДАННЫХ
            -- ============================================
            CREATE TABLE IF NOT EXISTS employees (
                id         INT PRIMARY KEY AUTO_INCREMENT,
                name       VARCHAR(100) NOT NULL,
                department VARCHAR(50),
                salary     DECIMAL(10,2),
                hired      DATE
            );
            
            INSERT INTO employees (name, department, salary, hired) VALUES
                ('Иван Петров', 'IT', 80000.00, '2020-03-15'),
                ('Мария Смирнова', 'HR', 65000.00, '2019-07-22'),
                ('Петр Сидоров', 'IT', 95000.00, '2018-11-01'),
                ('Анна Кузнецова', 'Finance', 72000.00, '2021-02-10'),
                ('Сергей Иванов', 'Marketing', 68000.00, '2020-09-14'),
                ('Елена Петрова', 'IT', 55000.00, '2019-05-30'),
                ('Алексей Васильев', 'Sales', 70000.00, '2021-06-01'),
                ('Анастасия Павлова', 'IT', 90000.00, '2018-03-20'),
                ('Дмитрий Новиков', 'HR', 58000.00, '2022-01-15'),
                ('Наталья Соколова', 'Finance', 82000.00, '2019-11-10'),
                ('Андрей Морозов', 'IT', 75000.00, '2021-08-05'),
                ('Александр Волков', 'Marketing', 85000.00, '2020-11-12');
            
            -- ============================================
            -- 1) ИМЯ НАЧИНАЕТСЯ НА 'А'
            -- ============================================
            -- % - любое количество символов после 'А'
            SELECT * FROM employees WHERE name LIKE 'А%';
            
            -- ============================================
            -- 2) ИМЯ ЗАКАНЧИВАЕТСЯ НА 'ов'
            -- ============================================
            -- % - любое количество символов перед 'ов'
            SELECT * FROM employees WHERE name LIKE '%ов';
            
            -- ============================================
            -- 3) В ИМЕНИ ЕСТЬ 'ан' (в любом месте)
            -- ============================================
            -- % - любое количество символов до и после 'ан'
            SELECT * FROM employees WHERE name LIKE '%ан%';
            
            -- ============================================
            -- 4) ИМЯ СОСТОИТ РОВНО ИЗ 4 СИМВОЛОВ
            -- ============================================
            -- _ - ровно один символ (4 подчёркивания = 4 символа)
            SELECT * FROM employees WHERE name LIKE '____';
            """;
        System.out.println(sql);
    }
}