/**
 * Задача 02 — Модуль 01: Несколько строк
 *
 * ЗАДАНИЕ:
 *   Выведите в консоль три строки (каждая с новой строки):
 *     - ваше имя
 *     - название города
 *     - любимый язык программирования
 *
 * ПРИМЕР ВЫВОДА:
 *   Иван
 *   Москва
 *   Java
 *
 * ПОДСКАЗКА:
 *   Понадобится три вызова System.out.println(...).
 */
public class Task02 {
    public static void main(String[] args) {
        // Ваш код здесь
    }
}
