/**
 * Задача 01 — Модуль 01: Первая программа
 *
 * ЗАДАНИЕ:
 *   Выведите в консоль строку: Hello, World!
 *
 * ОЖИДАЕМЫЙ ВЫВОД:
 *   Hello, World!
 *
 * ПОДСКАЗКА:
 *   Используйте System.out.println("...");
 */
public class Task01 {
    public static void main(String[] args) {
        // Ваш код здесь
    }
}
