/**
 * Задача 01 — Модуль 27: Установка и структура (упражнение в терминале)
 *
 * Это упражнение выполняется в терминале/файловой системе, не кодом.
 *
 * ЗАДАНИЕ:
 *   1. Проверьте, установлен ли Maven (если нет — установите).
 *   2. Создайте стандартную структуру каталогов Maven-проекта вручную:
 *        my-app/
 *          src/main/java/
 *          src/main/resources/
 *          src/test/java/
 *
 * ОЖИДАЕМЫЕ КОМАНДЫ:
 *   mvn -version
 *   (создание папок: mkdir -p src/main/java и т.д. / в IDEA — New Directory)
 *
 * ПРОВЕРКА:
 *   mvn -version печатает версию Maven и Java;
 *   структура каталогов соответствует стандарту.
 */
public class Task01 {
    public static void main(String[] args) {
        System.out.println("Выполните задание в терминале (см. комментарий выше).");
    }
}
