package m21_git.practice;

/**
 * Задача 01 — Модуль 21: Инициализация репозитория (упражнение в терминале)
 *
 * Это упражнение выполняется КОМАНДАМИ Git в терминале, а не кодом.
 * Java-файл — лишь носитель задания.
 *
 * ЗАДАНИЕ:
 *   1. Создайте новую папку git-practice и перейдите в неё.
 *   2. Инициализируйте репозиторий Git.
 *   3. Настройте имя и e-mail автора (если ещё не настроены).
 *   4. Проверьте состояние репозитория.
 *
 * ОЖИДАЕМЫЕ КОМАНДЫ:
 *   git init
 *   git config user.name "Ваше Имя"
 *   git config user.email "you@example.com"
 *   git status
 *
 * ПРОВЕРКА:
 *   git status выводит "On branch main / No commits yet".
 *   В папке появилась скрытая директория .git
 */
public class Task01 {
    public static void main(String[] args) {
        System.out.println("Выполните задание командами Git в терминале (см. комментарий выше).");
        System.out.println("Done");
    }
}
