package m01_intro_first_program.practice;

/**
 * Задача 05 — Модуль 01: Комментарии
 *
 * ЗАДАНИЕ:
 *   1. Выведите строку "Программа запущена".
 *   2. Выше этой инструкции добавьте однострочный комментарий,
 *      поясняющий, что делает строка.
 *   3. В самом верху метода main добавьте многострочный
 *      комментарий /* ... *\/ с описанием программы.
 *
 * ОЖИДАЕМЫЙ ВЫВОД:
 *   Программа запущена
 *
 * ПОДСКАЗКА:
 *   Комментарии не влияют на вывод — компилятор их игнорирует.
 */
public class Task05 {
    /*
    Проврека комментариев
     */
    public static void main(String[] args) {
        System.out.println("Programm running");
    }
}
