package m01_intro_first_program.practice;

/**
 * Задача 03 — Модуль 01: print vs println
 *
 * ЗАДАНИЕ:
 *   Используя ТОЛЬКО System.out.print(...) (без println),
 *   выведите слова "Java" и "Core" в одну строку через пробел.
 *
 * ОЖИДАЕМЫЙ ВЫВОД:
 *   Java Core
 *
 * ПОДСКАЗКА:
 *   print не переводит строку, поэтому несколько вызовов
 *   допишут текст друг за другом на одной строке.
 */
public class Task03 {
    public static void main(String[] args) {
        // Ваш код здесь
    }
}
