package m01_intro_first_program.practice;

/**
 * Задача 01 — Модуль 01: Первая программа
 *
 * ЗАДАНИЕ:
 *   Выведите в консоль строку: Hello, World!
 *
 * ОЖИДАЕМЫЙ ВЫВОД:
 *   Hello, World!
 *
 * ПОДСКАЗКА:
 *   Используйте System.out.println("...");
 */
public class Task01 {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }
}
