package m01_intro_first_program.practice;

/**
 * Задача 04 — Модуль 01: Спецсимвол перевода строки
 *
 * ЗАДАНИЕ:
 *   Выведите две строки, используя ОДИН вызов System.out.println(...),
 *   а перевод строки между ними задайте символом \n.
 *
 * ОЖИДАЕМЫЙ ВЫВОД:
 *   Строка первая
 *   Строка вторая
 *
 * ПОДСКАЗКА:
 *   "...\n..." — внутри одной строки \n означает переход на новую строку.
 */
public class Task04 {
    public static void main(String[] args) {
        System.out.println("First line\nSecond line");
    }
}
