/**
 * Задача 02 — Модуль 21: Первый коммит (упражнение в терминале)
 *
 * ЗАДАНИЕ:
 *   1. В репозитории из Task01 создайте файл hello.txt с любым текстом.
 *   2. Посмотрите статус — файл должен быть «untracked».
 *   3. Добавьте файл в индекс (staging).
 *   4. Сделайте коммит с осмысленным сообщением.
 *   5. Просмотрите историю коммитов.
 *
 * ОЖИДАЕМЫЕ КОМАНДЫ:
 *   git status
 *   git add hello.txt
 *   git commit -m "Добавил hello.txt"
 *   git log --oneline
 *
 * ПРОВЕРКА:
 *   git log показывает один коммит с вашим сообщением.
 */
public class Task02 {
    public static void main(String[] args) {
        System.out.println("Выполните задание командами Git в терминале (см. комментарий выше).");
    }
}
