/**
 * Задача 05 — Модуль 23: Анонимный класс
 *
 * ЗАДАНИЕ:
 *   Дан интерфейс Command с методом execute().
 *   Не создавая отдельных классов, создайте ДВА объекта Command
 *   через анонимные классы прямо в main:
 *     - первый выводит "Сохранение...";
 *     - второй выводит "Загрузка...".
 *   Вызовите execute() у обоих.
 *
 * ОЖИДАЕМЫЙ ВЫВОД:
 *   Сохранение...
 *   Загрузка...
 *
 * ПОДСКАЗКА:
 *   Command save = new Command() {
 *       public void execute() { System.out.println("Сохранение..."); }
 *   };
 */

public class Task05 {
    public static void main(String[] args) {
        // Создайте два анонимных Command и вызовите execute()
    }
}
