/**
 * Задача 01 — Модуль 84: первая миграция Flyway (V1__create_products.sql)
 *
 * ФОРМАТ: SQL-носитель. Это обычный .java с text-блоком и println (компилируется
 *   bare-javac, JDK 15+). Сам SQL вы поместите в файл миграции — см. ниже.
 *
 * ЗАДАНИЕ:
 *   1) Создайте каталог src/main/resources/db/migration/ (Flyway ищет миграции здесь).
 *   2) Создайте файл V1__create_products.sql и напишите в нём DDL таблицы products:
 *        - id        BIGINT, первичный ключ, авто-инкремент (GENERATED BY DEFAULT AS IDENTITY);
 *        - name      VARCHAR(255), NOT NULL;
 *        - price     INT, NOT NULL;
 *        - version   BIGINT, NOT NULL, DEFAULT 0   (под будущий @Version, Task04).
 *   3) В переменную SQL ниже впишите этот же DDL — задача напечатает его как образец.
 *   4) Подключите flyway-core и поставьте spring.jpa.hibernate.ddl-auto=validate —
 *      схему теперь ведёт Flyway, Hibernate лишь сверяет.
 *
 * ЦЕЛЬ: понять правила именования (V{версия}__{описание}.sql) и расположение миграций.
 *
 * ПОДСКАЗКА: двойное подчёркивание перед описанием обязательно: V1__... (не V1_...).
 *            Flyway применит файл один раз и запишет это в flyway_schema_history.
 */
public class Task01 {
    public static void main(String[] args) {
        String sql = """
                -- Файл: src/main/resources/db/migration/V1__create_products.sql
                -- TODO: напишите DDL таблицы products
                -- CREATE TABLE products (
                --     id      BIGINT GENERATED BY DEFAULT AS IDENTITY PRIMARY KEY,
                --     ...
                -- );
                """;
        System.out.println(sql);
    }
}
