package m02_variables_int_string.practice;

/**
 * Задача 01 — Модуль 02: Объявление переменных
 *
 * ЗАДАНИЕ:
 *   Объявите две переменные типа int: year (значение 2026)
 *   и month (значение 6). Выведите каждую на отдельной строке.
 *
 * ОЖИДАЕМЫЙ ВЫВОД:
 *   2026
 *   6
 *
 * ПОДСКАЗКА:
 *   int year = 2026;
 *   System.out.println(year);
 */
public class Task01 {
    public static void main(String[] args) {
        // Ваш код здесь
    }
}
